Wallet/src/DataProcessors/ЗагрузкаКурсовВалют/ЗагрузкаКурсовВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаКурсовВалют</name>
  <attributes>
    <name>ДатаЗагрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗагружаемыеВалюты</name>
    <attributes>
      <name>ЦифровойКодВалюты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>3</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СимвольныйКодВалюты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеВалюты</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Существует</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

Wallet/src/Catalogs/Валюты/Валюты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Валюты</name>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружаетсяИзИнтернета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Wallet/src/DataProcessors/ЗагрузкаКурсовВалют/Forms/ФормаЗагрузкиВалют/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	ОбновитьЗагружаемыеВалюты();
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Удалить(Команда)
	
	// Проверяем, что есть выделенная строка
    Если Элементы.ЗагружаемыеВалюты.ТекущиеДанные = Неопределено Тогда
        ПоказатьПредупреждение(, НСтр("ru = 'Выберите строку для удаления'"));
        Возврат;
    КонецЕсли;
    
    ИндексУдаляемойСтроки = Элементы.ЗагружаемыеВалюты.ТекущаяСтрока;
    ДанныеСтроки = Элементы.ЗагружаемыеВалюты.ТекущиеДанные;  
    
    ПараметрыВопроса = Новый Структура;
    ПараметрыВопроса.Вставить("Индекс", ИндексУдаляемойСтроки);
    
    ТекстВопроса = СтрШаблон("Удалить строку с валютой ""%1""?", ДанныеСтроки.НаименованиеВалюты);
    ОписаниеОповещенияВопроса = Новый ОписаниеОповещения("ПослеВопросаОбУдалении", ЭтотОбъект, ПараметрыВопроса);
    ПоказатьВопрос(ОписаниеОповещенияВопроса, ТекстВопроса, РежимДиалогаВопрос.ДаНет);
    
КонецПроцедуры

&НаКлиенте
Процедура Создать(Команда)
	
	Результат =  СоздатьНаСервере();
	Текст = "";
	
	// Показываем результат
    Если Результат.КоличествоСоздано > 0 Тогда
        Текст = СтрШаблон(Нстр("ru='Создано валют: %1'"), Результат.КоличествоСоздано) + Символы.ПС + 
        Результат.СписокСозданных + Символы.ПС;
    КонецЕсли;
    
    Если Результат.КоличествоОшибок > 0 Тогда
    	Текст = Текст + СтрШаблон(Нстр("ru='Ошибок при создании: %1'"), Результат.КоличествоОшибок) + Символы.ПС +
    	Результат.СписокОшибок;
    КонецЕсли;
    
    Если Текст <> "" Тогда
        ПоказатьОповещениеПользователя(Текст, , , СтатусОповещенияПользователя.Важное);
    КонецЕсли;
    
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЗагружаемыеВалюты()
	
	Объект.ЗагружаемыеВалюты.Очистить();
	ТаблицаДанных = ВзаимодействиеСВалютами.ПолучитьКурсВалют(ТекущаяДатаСеанса());
	ВзаимодействиеСВалютами.ОпределитьСуществованиеВалют(ТаблицаДанных);
        
	Для Каждого Элемент Из ТаблицаДанных Цикл
		
		НоваяСтрока = Объект.ЗагружаемыеВалюты.Добавить();
		НоваяСтрока.НаименованиеВалюты = Строка(Элемент.Vname);
		НоваяСтрока.ЦифровойКодВалюты = Строка(Элемент.Vcode);
		НоваяСтрока.СимвольныйКодВалюты = Строка(Элемент.VchCode);
		НоваяСтрока.Существует = Элемент.Существует;
		
	КонецЦикла;

КонецПроцедуры

&НаСервере
Функция СоздатьНаСервере()
	
	Результат = Новый Структура;
    Результат.Вставить("КоличествоСоздано", 0);
    Результат.Вставить("КоличествоОшибок", 0);
    Результат.Вставить("СписокОшибок", "");
    Результат.Вставить("СписокСозданных", "");
    
    СписокСозданных = Новый Массив;
    СписокОшибок = Новый Массив;
    
    ТЗ_Валюты  = Объект.ЗагружаемыеВалюты.Выгрузить(, "НаименованиеВалюты, СимвольныйКодВалюты, ЦифровойКодВалюты");
    ВзаимодействиеСВалютами.ОпределитьСуществованиеВалют(ТЗ_Валюты);
    
    НачатьТранзакцию();
    
    Попытка
        Для Каждого ДанныеВалюта Из ТЗ_Валюты Цикл
            
            Если ДанныеВалюта.Существует Тогда
                    // Валюта уже есть, пропускаем
                    Продолжить;
                КонецЕсли;
                
                // Создаем новый элемент справочника
                НоваяВалюта = Справочники.Валюты.СоздатьЭлемент();
                НоваяВалюта.Наименование = ДанныеВалюта.НаименованиеВалюты;
                НоваяВалюта.Код = ДанныеВалюта.ЦифровойКод;  // Цифровой код (643, 840, 978)
                НоваяВалюта.НаименованиеПолное = ДанныеВалюта.СимвольныйКодВалюты;  // RUB, USD, EUR
                НоваяВалюта.ЗагружаетсяИзИнтернета = Истина;
                
                Попытка
                	НоваяВалюта.Записать();
                Исключение
                	// Ошибка при записи валюты
                	СписокОшибок.Добавить(ДанныеВалюта.НаименованиеВалюты + ": " + ОписаниеОшибки());
                	Результат.КоличествоОшибок = Результат.КоличествоОшибок + 1;
                	Продолжить;
                КонецПопытки;
                
                // Добавляем в список успешных
                СписокСозданных.Добавить(ДанныеВалюта.НаименованиеВалюты);
                Результат.КоличествоСоздано = Результат.КоличествоСоздано + 1;
 
        КонецЦикла;      
        ЗафиксироватьТранзакцию();
        
    Исключение
        ОтменитьТранзакцию();
        
        // Критическая ошибка транзакции
        СписокОшибок.Добавить("Ошибка транзакции: " + ОписаниеОшибки());
        Результат.КоличествоОшибок = Результат.КоличествоОшибок + 1;
        
    КонецПопытки;
    
    // Формируем строковые списки для вывода
    Результат.СписокСозданных = СтрСоединить(СписокСозданных, ", ");
    Результат.СписокОшибок = СтрСоединить(СписокОшибок, ";" + Символы.ПС);
    
    Возврат Результат;
КонецФункции

&НаКлиенте
Процедура ПослеВопросаОбУдалении(Результат, Параметры) Экспорт
    
    Если Результат <> КодВозвратаДиалога.Да Тогда
        Возврат;
    КонецЕсли;
    
    Индекс = Параметры.Индекс;
    
    Если Индекс < 0 Или Индекс >= Объект.ЗагружаемыеВалюты.Количество() Тогда
        ПоказатьПредупреждение(, НСтр("ru = 'Строка уже была удалена'"));
        Возврат;
    КонецЕсли;
    
    Объект.ЗагружаемыеВалюты.Удалить(Индекс);
    Элементы.КурсыДляЗагрузки.Обновить();
    
    // Используем ПоказатьОповещениеПользователя для красивого уведомления
    ПоказатьОповещениеПользователя(НСтр("ru = 'Строка удалена'"), , , , СтатусОповещенияПользователя.Важное);
    
КонецПроцедуры

#КонецОбласти
